#+TITLE: September 13-29, 2019 (17 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2019-09-13>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-gandalfdwite: 1
  :wpd-sandeepk: 1.176
  :END:
** akshay196
*** DONE Automate the Boring Stuff with Python - Part II [5/5]
    CLOSED: [2019-09-19 Thu 08:00]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:   5.55
    :OWNER: akshay196
    :ID: READ.1567504631
    :TASKID: READ.1567504631
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-19 Thu 07:11]--[2019-09-19 Thu 08:00] =>  0:49
    CLOCK: [2019-09-18 Wed 21:36]--[2019-09-18 Wed 22:10] =>  0:34
    CLOCK: [2019-09-18 Wed 08:02]--[2019-09-18 Wed 08:40] =>  0:38
    CLOCK: [2019-09-18 Wed 07:59]--[2019-09-18 Wed 08:02] =>  0:03
    CLOCK: [2019-09-17 Tue 22:36]--[2019-09-17 Tue 23:51] =>  1:15
    CLOCK: [2019-09-17 Tue 07:12]--[2019-09-17 Tue 08:26] =>  1:14
    CLOCK: [2019-09-16 Mon 22:08]--[2019-09-16 Mon 22:20] =>  0:12
    CLOCK: [2019-09-14 Sat 19:04]--[2019-09-14 Sat 19:52] =>  0:48
    :END:
    - [X] Chapter 14. Working with CSV Files and JSON Data                    (1h)
    - [X] Chapter 15. Keeping Time, Scheduling Tasks, and Launching Programs  (1h)
    - [X] Chapter 16. Sending Email and Text Messages                         (1h)
    - [X] Chapter 17. Manipulating Images                                     (1h)
    - [X] Chapter 18. Controlling the Keyboard and Mouse with GUI Automation  (1h)
*** Design Patterns in the Real World, an Analysis-Based Approach
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1568391828
    :TASKID: READ.1568391828
    :END:
    by Allen Holub
    https://learning.oreilly.com/videos/design-patterns-in/9781491935828
    - [ ] Introduction                                   (10m)
    - [ ] What is A Design Pattern?                      (35m)
    - [ ] Template Method                                (20m)
    - [ ] Builder: Separating the UI from Domain Object  (30m)
    - [ ] Singleton and Utility                          (60m)
    - [ ] Abstract Factory                               (20m)
    - [ ] Class and Abstract Adapters                    (15m)
    - [ ] Decorator                                      (20m)
    - [ ] Bridge                                         (15m)
    - [ ] Facade                                         (15m)
    - [ ] Prototype and Composite                        (30m)
    - [ ] Flyweight and Flyweight Pool                   (30m)
    - [ ] Proxy                                          (30m)
    - [ ] Command                                        (30m)
    - [ ] Strategy                                       (20m)
    - [ ] The Chain of Responsibility                    (45m)
    - [ ] Iterators (Internal and External)              (30m)
    - [ ] Observer                                       (45m)
    - [ ] Mediator                                       (25m)
    - [ ] Memento                                        (30m)
    - [ ] State                                          (15m)
    - [ ] Active Object                                  (30m)
*** The Little Book of Python Anti-Patterns
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1568393288
    :TASKID: READ.1568393288
    :END:
    https://docs.quantifiedcode.com/python-anti-patterns/index.html
** bhavin192
*** DONE Prepare slides and demo for Rootconf Pune
    CLOSED: [2019-09-21 Sat 14:31]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:   7.02
    :OWNER:    bhavin192
    :ID:       OPS.1568541676
    :TASKID:   OPS.1568541676
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-21 Sat 14:11]--[2019-09-21 Sat 14:31] =>  0:20
    CLOCK: [2019-09-21 Sat 01:31]--[2019-09-21 Sat 02:23] =>  0:52
    CLOCK: [2019-09-21 Sat 00:37]--[2019-09-21 Sat 01:31] =>  0:54
    CLOCK: [2019-09-20 Fri 18:56]--[2019-09-20 Fri 19:35] =>  0:39
    CLOCK: [2019-09-19 Thu 21:43]--[2019-09-19 Thu 22:41] =>  0:58
    CLOCK: [2019-09-19 Thu 19:45]--[2019-09-19 Thu 20:33] =>  0:48
    CLOCK: [2019-09-17 Tue 22:09]--[2019-09-17 Tue 22:33] =>  0:24
    CLOCK: [2019-09-17 Tue 20:18]--[2019-09-17 Tue 20:24] =>  0:06
    CLOCK: [2019-09-17 Tue 18:52]--[2019-09-17 Tue 19:41] =>  0:49
    CLOCK: [2019-09-16 Mon 19:16]--[2019-09-16 Mon 20:27] =>  1:11
    :END:
*** IN_PROGRESS Kubernetes Security: Attacking and Defending Kubernetes
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   0.83
    :OWNER:    bhavin192
    :ID:       READ.1568541771
    :TASKID:   READ.1568541771
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-23 Mon 19:20]--[2019-09-23 Mon 20:10] =>  0:50
    :END:
    https://learning.oreilly.com/live-training/courses/kubernetes-security-attacking-and-defending-kubernetes/0636920295549/
*** Blog post about creating PR to src.fedoraproject.org
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       WRITE.1568541846
    :TASKID:   WRITE.1568541846
    :END:
** gandalfdwite
*** TODO Data Structure and Algorithmic Thinking with Python (By Narsimha Karumanchi) Part-VII [0/3]
    :PROPERTIES:
    :ESTIMATED: 3.0
    :ACTUAL:   0.00
    :OWNER: gandalfdwite
    :ID: READ.1553531542
    :TASKID: READ.1553531542
    :END:
    - [ ] 18. Divide and Conquer Algorithms    ( 1h)
    - [ ] 19. Dynamic Programming              ( 1h)
    - [ ] 20. Complexity Classes               ( 1h)
*** IN_PROGRESS Cloud Native DevOps - Part I [5/6]
    :PROPERTIES:
    :ESTIMATED: 14.0
    :ACTUAL:   14.12
    :OWNER: gandalfdwite
    :ID: READ.1568308423
    :TASKID: READ.1568308423
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-26 Thu 21:29]--[2019-09-26 Thu 22:30] =>  1:01
    CLOCK: [2019-09-25 Wed 23:00]--[2019-09-26 Thu 00:16] =>  1:16
    CLOCK: [2019-09-24 Tue 23:30]--[2019-09-25 Wed 00:41] =>  1:11
    CLOCK: [2019-09-22 Sun 13:37]--[2019-09-22 Sun 14:59] =>  1:22
    CLOCK: [2019-09-21 Sat 22:53]--[2019-09-22 Sun 00:20] =>  1:27
    CLOCK: [2019-09-19 Thu 21:10]--[2019-09-19 Thu 22:07] =>  0:57
    CLOCK: [2019-09-18 Wed 19:52]--[2019-09-18 Wed 20:48] =>  0:56
    CLOCK: [2019-09-17 Tue 20:48]--[2019-09-17 Tue 21:53] =>  1:05
    CLOCK: [2019-09-15 Sun 11:40]--[2019-09-15 Sun 13:54] =>  2:14
    CLOCK: [2019-09-15 Sun 09:42]--[2019-09-15 Sun 10:20] =>  0:38
    CLOCK: [2019-09-14 Sat 21:26]--[2019-09-14 Sat 22:22] =>  0:56
    CLOCK: [2019-09-13 Fri 23:57]--[2019-09-14 Sat 01:01] =>  1:04
    :END:
    - [X] 2. First Steps with Kubernetes       ( 2h )
    - [X] 3. Getting Kubernetes                ( 2h )
    - [X] 4. Working with Kubernetes Object    ( 3h )
    - [X] 5. Managing Resources                ( 3h )
    - [X] 6. Operating Clusters                ( 2h )
    - [ ] 7. Kubernetes Power Tools            ( 2h )
** sandeepk
*** IN_PROGRESS Blog post to write [1/2]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   3.67
    :OWNER: sandeepk
    :ID: WRITE.1560792221
    :TASKID: WRITE.1560792221
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-19 Thu 22:30]--[2019-09-19 Thu 23:00] =>  0:30
    CLOCK: [2019-09-18 Wed 08:30]--[2019-09-18 Wed 09:00] =>  0:30
    CLOCK: [2019-09-17 Tue 23:30]--[2019-09-18 Wed 00:10] =>  0:40
    CLOCK: [2019-09-17 Tue 20:30]--[2019-09-17 Tue 20:50] =>  0:20
    CLOCK: [2019-09-17 Tue 09:00]--[2019-09-17 Tue 10:05] =>  1:05
    CLOCK: [2019-09-16 Mon 20:30]--[2019-09-16 Mon 21:05] =>  0:35
    :END:
    - [X] Blog post on Closures   (2h)
    - [ ] Blog post on Generators (2h)
*** IN_PROGRESS [#B] Dive into Python3 [2/4]
    :PROPERTIES:
    :ESTIMATED: 11
    :ACTUAL:   3.43
    :OWNER: sandeepk
    :ID: READ.1559639223
    :TASKID: READ.1559639223
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-22 Sun 23:30]--[2019-09-23 Mon 00:56] =>  1:26
    CLOCK: [2019-09-22 Sun 18:00]--[2019-09-22 Sun 19:00] =>  1:00
    CLOCK: [2019-09-16 Mon 08:30]--[2019-09-16 Mon 09:30] =>  1:00
    :END:
    - [X] Chapter 9 - Unit Testing  (2h)
    - [X] Chapter 10 - Refactoring  (2h)
    - [ ] Chapter 11 - Files        (4h)
    - [ ] Chapter 12 - XML          (3h)

*** 2PI[Slack Bot] [/2]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: sandeepk
    :ID: DEV.1568559197
    :TASKID: DEV.1568559197
    :END:
    - [ ] Repo Creation, Planning of the architecture.  (2h)
    - [ ] Emacs setup for the project.                  (3h)

